[Survived] BlockStatement
source/lib/bdd-utility.ts:49:11
 function template_label(
   strings: TemplateStringsArray,
   values: unknown[],
-): string {
-  return String.raw({ raw: strings }, ...values);
-}
+): string {}
 
 function make_given() {

[Killed] ObjectLiteral
source/lib/bdd-utility.ts:50:21
   strings: TemplateStringsArray,
   values: unknown[],
 ): string {
-  return String.raw({ raw: strings }, ...values);
+  return String.raw({}, ...values);
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.91ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.58ms]

[Killed] ArrowFunction
source/lib/bdd-utility.ts:60:19
   ) => {
     const label = template_label(strings, values);
 
-    const given = <GivenReturnType>(
-      fn: (_: never) => GivenReturnType,
-    ): GivenStep<GivenReturnType> & MetaData => ({
-      kind: "given",
-      label,
-      fn,
-    });
+    const given = () => undefined;
 
     given.from_fc = <GivenFcReturnType>(
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.25ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.48ms]

[Survived] StringLiteral
source/lib/bdd-utility.ts:63:13
     const given = <GivenReturnType>(
       fn: (_: never) => GivenReturnType,
     ): GivenStep<GivenReturnType> & MetaData => ({
-      kind: "given",
+      kind: "",
       label,
       fn,

[Killed] ArrowFunction
source/lib/bdd-utility.ts:68:21
       fn,
     });
 
-    given.from_fc = <GivenFcReturnType>(
-      fn: (_: never) => fc.Arbitrary<GivenFcReturnType>,
-    ): GivenFcStep<GivenFcReturnType> & MetaData => ({
-      kind: "given_fc",
-      label,
-      fn,
-    });
+    given.from_fc = () => undefined;
 
     given.such_as = <GivenSuchAsReturnType>(
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/pesel.test.ts:

# Unhandled error between tests
-------------------------------
227 |           describe(stryMutAct_9fa48("32") ? `` : (stryCov_9fa48("32"), `SCENARIO: ${title}`), () => {

[Killed] ArrowFunction
source/lib/bdd-utility.ts:76:21
       fn,
     });
 
-    given.such_as = <GivenSuchAsReturnType>(
-      fn: (_: never) => GivenSuchAsReturnType[],
-    ): GivenSuchAsStep<GivenSuchAsReturnType> & MetaData => ({
-      kind: "given_such_as",
-      label,
-      fn,
-    });
+    given.such_as = () => undefined;
 
     return given;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [19.53ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.25ms]

(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Survived] StringLiteral
source/lib/bdd-utility.ts:79:13
     given.such_as = <GivenSuchAsReturnType>(
       fn: (_: never) => GivenSuchAsReturnType[],
     ): GivenSuchAsStep<GivenSuchAsReturnType> & MetaData => ({
-      kind: "given_such_as",
+      kind: "",
       label,
       fn,

[Killed] BlockStatement
source/lib/bdd-utility.ts:88:22
   };
 }
 
-function make_when() {
-  return (
-    strings: TemplateStringsArray,
-    ...values: unknown[]
-  ) => {
-    const label = template_label(strings, values);
-
-    return <GivenReturnType, WhenReturnType>(
-      fn: (args: { input: GivenReturnType }) => WhenReturnType,
-    ): WhenStep<GivenReturnType, WhenReturnType> & MetaData => ({
-      kind: "when",
-      label,
-      fn,
-    });
-  };
-}
+function make_when() {}
 
 function make_then() {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.95ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.74ms]
(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Killed] BlockStatement
source/lib/bdd-utility.ts:92:8
   return (
     strings: TemplateStringsArray,
     ...values: unknown[]
-  ) => {
-    const label = template_label(strings, values);
-
-    return <GivenReturnType, WhenReturnType>(
-      fn: (args: { input: GivenReturnType }) => WhenReturnType,
-    ): WhenStep<GivenReturnType, WhenReturnType> & MetaData => ({
-      kind: "when",
-      label,
-      fn,
-    });
-  };
+  ) => {};
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/pesel.test.ts:

# Unhandled error between tests
-------------------------------
23 |     given `empty input`

[Killed] ArrowFunction
source/lib/bdd-utility.ts:95:12
   ) => {
     const label = template_label(strings, values);
 
-    return <GivenReturnType, WhenReturnType>(
-      fn: (args: { input: GivenReturnType }) => WhenReturnType,
-    ): WhenStep<GivenReturnType, WhenReturnType> & MetaData => ({
-      kind: "when",
-      label,
-      fn,
-    });
+    return () => undefined;
   };
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.71ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.34ms]

[Survived] StringLiteral
source/lib/bdd-utility.ts:98:13
     return <GivenReturnType, WhenReturnType>(
       fn: (args: { input: GivenReturnType }) => WhenReturnType,
     ): WhenStep<GivenReturnType, WhenReturnType> & MetaData => ({
-      kind: "when",
+      kind: "",
       label,
       fn,

[Killed] BlockStatement
source/lib/bdd-utility.ts:105:22
   };
 }
 
-function make_then() {
-  return (
-    strings: TemplateStringsArray,
-    ...values: unknown[]
-  ) => {
-    const label = template_label(strings, values);
-
-    return <WhenReturnType, GivenReturnType>(
-      fn: (args: { result: WhenReturnType, input: GivenReturnType }) => void,
-    ): ThenStep<WhenReturnType, GivenReturnType> & MetaData => ({
-      kind: "then",
-      label,
-      fn,
-    });
-  };
-}
+function make_then() {}
 
 function make_and() {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.10ms]


source/regon.test.ts:

[Killed] BlockStatement
source/lib/bdd-utility.ts:109:8
   return (
     strings: TemplateStringsArray,
     ...values: unknown[]
-  ) => {
-    const label = template_label(strings, values);
-
-    return <WhenReturnType, GivenReturnType>(
-      fn: (args: { result: WhenReturnType, input: GivenReturnType }) => void,
-    ): ThenStep<WhenReturnType, GivenReturnType> & MetaData => ({
-      kind: "then",
-      label,
-      fn,
-    });
-  };
+  ) => {};
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.10ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.61ms]

(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Killed] ArrowFunction
source/lib/bdd-utility.ts:112:12
   ) => {
     const label = template_label(strings, values);
 
-    return <WhenReturnType, GivenReturnType>(
-      fn: (args: { result: WhenReturnType, input: GivenReturnType }) => void,
-    ): ThenStep<WhenReturnType, GivenReturnType> & MetaData => ({
-      kind: "then",
-      label,
-      fn,
-    });
+    return () => undefined;
   };
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.12ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.50ms]

[Survived] BlockStatement
source/lib/bdd-utility.ts:122:21
   };
 }
 
-function make_and() {
-  return (
-    strings: TemplateStringsArray,
-    ...values: unknown[]
-  ) => {
-    const label = template_label(strings, values);
-
-    return <WhenOutput, GivenInput>(
-      fn: (args: { result: WhenOutput, input: GivenInput }) => void,
-    ): AndStep<WhenOutput, GivenInput> & MetaData => ({
-      kind: "and_also",
-      label,
-      fn,
-    });
-  };
-}
+function make_and() {}
 
 export const $ = {

[Survived] BlockStatement
source/lib/bdd-utility.ts:126:8
   return (
     strings: TemplateStringsArray,
     ...values: unknown[]
-  ) => {
-    const label = template_label(strings, values);
-
-    return <WhenOutput, GivenInput>(
-      fn: (args: { result: WhenOutput, input: GivenInput }) => void,
-    ): AndStep<WhenOutput, GivenInput> & MetaData => ({
-      kind: "and_also",
-      label,
-      fn,
-    });
-  };
+  ) => {};
 }
 

[Survived] ArrowFunction
source/lib/bdd-utility.ts:129:12
   ) => {
     const label = template_label(strings, values);
 
-    return <WhenOutput, GivenInput>(
-      fn: (args: { result: WhenOutput, input: GivenInput }) => void,
-    ): AndStep<WhenOutput, GivenInput> & MetaData => ({
-      kind: "and_also",
-      label,
-      fn,
-    });
+    return () => undefined;
   };
 }

[Survived] ObjectLiteral
source/lib/bdd-utility.ts:131:55
 
     return <WhenOutput, GivenInput>(
       fn: (args: { result: WhenOutput, input: GivenInput }) => void,
-    ): AndStep<WhenOutput, GivenInput> & MetaData => ({
-      kind: "and_also",
-      label,
-      fn,
-    });
+    ): AndStep<WhenOutput, GivenInput> & MetaData => ({});
   };
 }

[Killed] ObjectLiteral
source/lib/bdd-utility.ts:139:18
   };
 }
 
-export const $ = {
-  scenario,
-  given: make_given(),
-  when: make_when(),
-  then: make_then(),
-  and: make_and()
-};
+export const $ = {};
 
 type GivenValue<G> =
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.16ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.68ms]

[Killed] EqualityOperator
source/lib/bdd-utility.ts:176:11
     describe(`SCENARIO: ${title}`, () => {
 
 
-      if (given.kind === "given_such_as") {
+      if (given.kind !== "given_such_as") {
         const given_inputs = given.fn(undefined as never);
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [10.13ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.45ms]

[Killed] ConditionalExpression
source/lib/bdd-utility.ts:176:11
     describe(`SCENARIO: ${title}`, () => {
 
 
-      if (given.kind === "given_such_as") {
+      if (true) {
         const given_inputs = given.fn(undefined as never);
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [16.21ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [13.96ms]

[Survived] BlockStatement
source/lib/bdd-utility.ts:179:85
       if (given.kind === "given_such_as") {
         const given_inputs = given.fn(undefined as never);
 
-        describe.each(given_inputs)(`GIVEN ${given.label}`, (given_single_input) => {
-          describe(`WHEN ${when.label}`, () => {
-            const when_result = when.fn({ input: given_single_input });
-
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_single_input });
-            })
-
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_single_input })
-              })
-            }
-          })
-        })
+        describe.each(given_inputs)(`GIVEN ${given.label}`, (given_single_input) => {})
 
         return

[Survived] StringLiteral
source/lib/bdd-utility.ts:179:37
       if (given.kind === "given_such_as") {
         const given_inputs = given.fn(undefined as never);
 
-        describe.each(given_inputs)(`GIVEN ${given.label}`, (given_single_input) => {
+        describe.each(given_inputs)(``, (given_single_input) => {
           describe(`WHEN ${when.label}`, () => {
             const when_result = when.fn({ input: given_single_input });

[Survived] BlockStatement
source/lib/bdd-utility.ts:180:48
         const given_inputs = given.fn(undefined as never);
 
         describe.each(given_inputs)(`GIVEN ${given.label}`, (given_single_input) => {
-          describe(`WHEN ${when.label}`, () => {
-            const when_result = when.fn({ input: given_single_input });
-
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_single_input });
-            })
-
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_single_input })
-              })
-            }
-          })
+          describe(`WHEN ${when.label}`, () => {})
         })
 

[Survived] StringLiteral
source/lib/bdd-utility.ts:180:20
         const given_inputs = given.fn(undefined as never);
 
         describe.each(given_inputs)(`GIVEN ${given.label}`, (given_single_input) => {
-          describe(`WHEN ${when.label}`, () => {
+          describe(``, () => {
             const when_result = when.fn({ input: given_single_input });
 

[Survived] BlockStatement
source/lib/bdd-utility.ts:183:44
           describe(`WHEN ${when.label}`, () => {
             const when_result = when.fn({ input: given_single_input });
 
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_single_input });
-            })
+            it(`THEN ${then.label}`, () => {})
 
             for (const and of ands) {

[Survived] StringLiteral
source/lib/bdd-utility.ts:183:16
           describe(`WHEN ${when.label}`, () => {
             const when_result = when.fn({ input: given_single_input });
 
-            it(`THEN ${then.label}`, () => {
+            it(``, () => {
               then.fn({ result: when_result, input: given_single_input });
             })

[Killed] ObjectLiteral
source/lib/bdd-utility.ts:184:23
             const when_result = when.fn({ input: given_single_input });
 
             it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_single_input });
+              then.fn({});
             })
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.46ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.53ms]

[Survived] BlockStatement
source/lib/bdd-utility.ts:187:37
               then.fn({ result: when_result, input: given_single_input });
             })
 
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_single_input })
-              })
-            }
+            for (const and of ands) {}
           })
         })

[Survived] BlockStatement
source/lib/bdd-utility.ts:188:44
             })
 
             for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_single_input })
-              })
+              it(`AND ${and.label}`, () => {})
             }
           })

[Survived] BlockStatement
source/lib/bdd-utility.ts:199:35
       }
 
 
-      if (given.kind === "given") {
-        const given_input = given.fn(undefined as never);
-
-        describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            const when_result = when.fn({ input: given_input });
-
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_input });
-            })
-
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_input })
-              })
-            }
-          })
-        })
-        return
-      }
+      if (given.kind === "given") {}
 
       if (given.kind === "given_fc") {

[Survived] ConditionalExpression
source/lib/bdd-utility.ts:199:11
       }
 
 
-      if (given.kind === "given") {
+      if (false) {
         const given_input = given.fn(undefined as never);
 

[Survived] BlockStatement
source/lib/bdd-utility.ts:202:48
       if (given.kind === "given") {
         const given_input = given.fn(undefined as never);
 
-        describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            const when_result = when.fn({ input: given_input });
-
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_input });
-            })
-
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_input })
-              })
-            }
-          })
-        })
+        describe(`GIVEN ${given.label}`, () => {})
         return
       }

[Survived] BlockStatement
source/lib/bdd-utility.ts:203:48
         const given_input = given.fn(undefined as never);
 
         describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            const when_result = when.fn({ input: given_input });
-
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_input });
-            })
-
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_input })
-              })
-            }
-          })
+          describe(`WHEN ${when.label}`, () => {})
         })
         return

[Killed] ObjectLiteral
source/lib/bdd-utility.ts:204:41
 
         describe(`GIVEN ${given.label}`, () => {
           describe(`WHEN ${when.label}`, () => {
-            const when_result = when.fn({ input: given_input });
+            const when_result = when.fn({});
 
             it(`THEN ${then.label}`, () => {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [10.63ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.23ms]

[Survived] BlockStatement
source/lib/bdd-utility.ts:206:44
           describe(`WHEN ${when.label}`, () => {
             const when_result = when.fn({ input: given_input });
 
-            it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_input });
-            })
+            it(`THEN ${then.label}`, () => {})
 
             for (const and of ands) {

[Killed] ObjectLiteral
source/lib/bdd-utility.ts:207:23
             const when_result = when.fn({ input: given_input });
 
             it(`THEN ${then.label}`, () => {
-              then.fn({ result: when_result, input: given_input });
+              then.fn({});
             })
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [11.82ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.38ms]

[Survived] BlockStatement
source/lib/bdd-utility.ts:210:37
               then.fn({ result: when_result, input: given_input });
             })
 
-            for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_input })
-              })
-            }
+            for (const and of ands) {}
           })
         })

[Survived] BlockStatement
source/lib/bdd-utility.ts:211:44
             })
 
             for (const and of ands) {
-              it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_input })
-              })
+              it(`AND ${and.label}`, () => {})
             }
           })

[Survived] StringLiteral
source/lib/bdd-utility.ts:211:18
             })
 
             for (const and of ands) {
-              it(`AND ${and.label}`, () => {
+              it(``, () => {
                 and.fn({ result: when_result, input: given_input })
               })

[Survived] ObjectLiteral
source/lib/bdd-utility.ts:212:24
 
             for (const and of ands) {
               it(`AND ${and.label}`, () => {
-                and.fn({ result: when_result, input: given_input })
+                and.fn({})
               })
             }

[Survived] ConditionalExpression
source/lib/bdd-utility.ts:220:11
         return
       }
 
-      if (given.kind === "given_fc") {
+      if (true) {
         describe(`GIVEN ${given.label}`, () => {
           describe(`WHEN ${when.label}`, () => {

[Survived] ConditionalExpression
source/lib/bdd-utility.ts:220:11
         return
       }
 
-      if (given.kind === "given_fc") {
+      if (false) {
         describe(`GIVEN ${given.label}`, () => {
           describe(`WHEN ${when.label}`, () => {

[Survived] BlockStatement
source/lib/bdd-utility.ts:221:48
       }
 
       if (given.kind === "given_fc") {
-        describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
-              () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
-              })
-          })
-        })
+        describe(`GIVEN ${given.label}`, () => {})
         return
       }

[Survived] CallExpression
source/lib/bdd-utility.ts:221:9
       }
 
       if (given.kind === "given_fc") {
-        describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
-              () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
-              })
-          })
-        })
+        ;
         return
       }

[Survived] BlockStatement
source/lib/bdd-utility.ts:222:48
 
       if (given.kind === "given_fc") {
         describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
-              () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
-              })
-          })
+          describe(`WHEN ${when.label}`, () => {})
         })
         return

[Survived] CallExpression
source/lib/bdd-utility.ts:222:11
 
       if (given.kind === "given_fc") {
         describe(`GIVEN ${given.label}`, () => {
-          describe(`WHEN ${when.label}`, () => {
-            it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
-              () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
-              })
-          })
+          ;
         })
         return

[Survived] CallExpression
source/lib/bdd-utility.ts:223:13
       if (given.kind === "given_fc") {
         describe(`GIVEN ${given.label}`, () => {
           describe(`WHEN ${when.label}`, () => {
-            it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
-              () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
-              })
+            ;
           })
         })

[Survived] ArrowFunction
source/lib/bdd-utility.ts:224:46
         describe(`GIVEN ${given.label}`, () => {
           describe(`WHEN ${when.label}`, () => {
             it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
+              `THEN ${then.label} ${ands.map(() => undefined).join(" ")}`,
               () => {
                 fc.assert(

[Survived] StringLiteral
source/lib/bdd-utility.ts:224:15
         describe(`GIVEN ${given.label}`, () => {
           describe(`WHEN ${when.label}`, () => {
             it(
-              `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
+              ``,
               () => {
                 fc.assert(

[Survived] BlockStatement
source/lib/bdd-utility.ts:225:21
           describe(`WHEN ${when.label}`, () => {
             it(
               `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
-              () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
-              })
+              () => {})
           })
         })

[Survived] CallExpression
source/lib/bdd-utility.ts:226:17
             it(
               `THEN ${then.label} ${ands.map(and => "AND " + and.label).join(" ")}`,
               () => {
-                fc.assert(
-                  fc.property(
-                    given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
-                  ),
-                );
+                ;
               })
           })
