[Survived] BlockStatement
source/lib/bdd-utility.ts:229:38
                 fc.assert(
                   fc.property(
                     given.fn(undefined as never),
-                    (given_input) => {
-                      const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
-
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
-                    },
+                    (given_input) => {},
                   ),
                 );

[Killed] ObjectLiteral
source/lib/bdd-utility.ts:231:31
                     given.fn(undefined as never),
                     (given_input) => {
                       const when_result = when.fn({ input: given_input });
-                      then.fn({ result: when_result, input: given_input });
+                      then.fn({});
 
                       for (const and of ands) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.30ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [4.12ms]

[Survived] BlockStatement
source/lib/bdd-utility.ts:233:47
                       const when_result = when.fn({ input: given_input });
                       then.fn({ result: when_result, input: given_input });
 
-                      for (const and of ands) {
-                        and.fn({ result: when_result, input: given_input })
-                      }
+                      for (const and of ands) {}
                     },
                   ),
