[Killed] BlockStatement
source/lib/fc-utilities.ts:3:95
 import fc from "fast-check"
 
-export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
-  if (options?.exact_length)
-    return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
-      .filter(fcstring => fcstring.length >= options.exact_length);
-  else
-    return fc.stringMatching(/.*\D.*/)
-}
+export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {}
 
 export function get_fc_numeric_string(options?: { min_length?: number; max_length?: number; }) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.64ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.45ms]

[Killed] ConditionalExpression
source/lib/fc-utilities.ts:4:7
 import fc from "fast-check"
 
 export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
-  if (options?.exact_length)
+  if (true)
     return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
       .filter(fcstring => fcstring.length >= options.exact_length);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.52ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.46ms]

[Killed] OptionalChaining
source/lib/fc-utilities.ts:4:7
 import fc from "fast-check"
 
 export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
-  if (options?.exact_length)
+  if (options.exact_length)
     return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
       .filter(fcstring => fcstring.length >= options.exact_length);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.61ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [4.84ms]

[Survived] MethodExpression
source/lib/fc-utilities.ts:5:12
 
 export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
   if (options?.exact_length)
-    return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
-      .filter(fcstring => fcstring.length >= options.exact_length);
+    return fc.stringMatching(/.*\D.*/, {
+  maxLength: options.exact_length
+});
   else
     return fc.stringMatching(/.*\D.*/)

[Survived] ObjectLiteral
source/lib/fc-utilities.ts:5:40
 
 export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
   if (options?.exact_length)
-    return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
+    return fc.stringMatching(/.*\D.*/, {})
       .filter(fcstring => fcstring.length >= options.exact_length);
   else

[Survived] ConditionalExpression
source/lib/fc-utilities.ts:6:27
 export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
   if (options?.exact_length)
     return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
-      .filter(fcstring => fcstring.length >= options.exact_length);
+      .filter(fcstring => false);
   else
     return fc.stringMatching(/.*\D.*/)

[Survived] EqualityOperator
source/lib/fc-utilities.ts:6:27
 export function get_fc_string_with_at_least_one_non_digit(options?: { exact_length: number }) {
   if (options?.exact_length)
     return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
-      .filter(fcstring => fcstring.length >= options.exact_length);
+      .filter(fcstring => fcstring.length > options.exact_length);
   else
     return fc.stringMatching(/.*\D.*/)

[Survived] Regex
source/lib/fc-utilities.ts:8:30
     return fc.stringMatching(/.*\D.*/, { maxLength: options.exact_length })
       .filter(fcstring => fcstring.length >= options.exact_length);
   else
-    return fc.stringMatching(/.*\D.*/)
+    return fc.stringMatching(/.\D.*/)
 }
 

[Killed] BlockStatement
source/lib/fc-utilities.ts:11:96
     return fc.stringMatching(/.*\D.*/)
 }
 
-export function get_fc_numeric_string(options?: { min_length?: number; max_length?: number; }) {
-  return fc
-    .array(fc.integer({ min: 0, max: 9 }), {
-      minLength: options?.min_length,
-      maxLength: options?.max_length,
-    })
-    .map(digits => digits.join(""));
-}
+export function get_fc_numeric_string(options?: { min_length?: number; max_length?: number; }) {}
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [18.58ms]

[Survived] OptionalChaining
source/lib/fc-utilities.ts:14:18
 export function get_fc_numeric_string(options?: { min_length?: number; max_length?: number; }) {
   return fc
     .array(fc.integer({ min: 0, max: 9 }), {
-      minLength: options?.min_length,
+      minLength: options.min_length,
       maxLength: options?.max_length,
     })

[Survived] OptionalChaining
source/lib/fc-utilities.ts:15:18
   return fc
     .array(fc.integer({ min: 0, max: 9 }), {
       minLength: options?.min_length,
-      maxLength: options?.max_length,
+      maxLength: options.max_length,
     })
     .map(digits => digits.join(""));

[Killed] ArrowFunction
source/lib/fc-utilities.ts:17:10
       minLength: options?.min_length,
       maxLength: options?.max_length,
     })
-    .map(digits => digits.join(""));
+    .map(() => undefined);
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [16.09ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.49ms]

[Survived] StringLiteral
source/lib/fc-utilities.ts:17:32
       minLength: options?.min_length,
       maxLength: options?.max_length,
     })
-    .map(digits => digits.join(""));
+    .map(digits => digits.join("Stryker was here!"));
 }
 
