[Killed] BlockStatement
source/lib/result.ts:13:51
   readonly value?: never
 }
 
-export function ok<T>(value: T): Result<T, never> {
-  return { ok: true, value };
-}
+export function ok<T>(value: T): Result<T, never> {}
 
 export function err<E extends Error>(error: Readonly<E>): Result<never, E> {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.77ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.87ms]

[Killed] BooleanLiteral
source/lib/result.ts:14:16
 }
 
 export function ok<T>(value: T): Result<T, never> {
-  return { ok: true, value };
+  return { ok: false, value };
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL

[Killed] BlockStatement
source/lib/result.ts:17:76
   return { ok: true, value };
 }
 
-export function err<E extends Error>(error: Readonly<E>): Result<never, E> {
-  return { ok: false, error } as const;
-}
+export function err<E extends Error>(error: Readonly<E>): Result<never, E> {}
 
 export type Result<T, E extends Error> =
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
2464 | 	return error;
2465 | }
2466 | /** @internal */
2467 | function throwIfFailed(out) {
