[Killed] BlockStatement
source/lib/test-scenario-utility.ts:4:50
 import fc from "fast-check";
 import { describe, it } from "vitest";
 
-export function scenario(scenario_title: string) {
-  return {
-    fc: () => scenario_fc(scenario_title),
-    for_values: <GivenValues extends readonly any[]>(given_values: GivenValues) => scenario_for_values(scenario_title, given_values),
-    given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
-      when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
-        then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
-          describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
-              const given_value = arrange();
-              const when_result = act(given_value);
-              assert(when_result, given_value);
-            });
-          });
-        },
-      }),
-    }),
-  };
-}
+export function scenario(scenario_title: string) {}
 
 function scenario_for_values<InitialValue>(scenario_title: string, initial_values: readonly InitialValue[]) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:6:9
 
 export function scenario(scenario_title: string) {
   return {
-    fc: () => scenario_fc(scenario_title),
+    fc: () => undefined,
     for_values: <GivenValues extends readonly any[]>(given_values: GivenValues) => scenario_for_values(scenario_title, given_values),
     given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:

# Unhandled error between tests
-------------------------------
16 | type NipValidationResult = ReturnType<typeof validate_nip>

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:7:17
 export function scenario(scenario_title: string) {
   return {
     fc: () => scenario_fc(scenario_title),
-    for_values: <GivenValues extends readonly any[]>(given_values: GivenValues) => scenario_for_values(scenario_title, given_values),
+    for_values: () => undefined,
     given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
       when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:

# Unhandled error between tests
-------------------------------
90 |         }

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:8:12
   return {
     fc: () => scenario_fc(scenario_title),
     for_values: <GivenValues extends readonly any[]>(given_values: GivenValues) => scenario_for_values(scenario_title, given_values),
-    given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
-      when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
-        then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
-          describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
-              const given_value = arrange();
-              const when_result = act(given_value);
-              assert(when_result, given_value);
-            });
-          });
-        },
-      }),
-    }),
+    given: () => undefined,
   };
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:

# Unhandled error between tests
-------------------------------
109 |         }

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:9:13
     fc: () => scenario_fc(scenario_title),
     for_values: <GivenValues extends readonly any[]>(given_values: GivenValues) => scenario_for_values(scenario_title, given_values),
     given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
-      when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
-        then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
-          describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
-              const given_value = arrange();
-              const when_result = act(given_value);
-              assert(when_result, given_value);
-            });
-          });
-        },
-      }),
+      when: () => undefined,
     }),
   };
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:

# Unhandled error between tests
-------------------------------
110 |       })

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:10:105
     for_values: <GivenValues extends readonly any[]>(given_values: GivenValues) => scenario_for_values(scenario_title, given_values),
     given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
       when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
-        then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
-          describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
-              const given_value = arrange();
-              const when_result = act(given_value);
-              assert(when_result, given_value);
-            });
-          });
-        },
+        then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {},
       }),
     }),

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:11:42
     given: <GivenValue>(given_label: string, arrange: () => GivenValue) => ({
       when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
         then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
-          describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
-              const given_value = arrange();
-              const when_result = act(given_value);
-              assert(when_result, given_value);
-            });
-          });
+          describe(scenario_title, () => {});
         },
       }),

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:12:84
       when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
         then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
           describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
-              const given_value = arrange();
-              const when_result = act(given_value);
-              assert(when_result, given_value);
-            });
+            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {});
           });
         },

[Survived] StringLiteral
source/lib/test-scenario-utility.ts:12:16
       when: <WhenResult>(when_label: string, act: (given_value: GivenValue) => WhenResult) => ({
         then: (then_label: string, assert: (when_result: WhenResult, given_val: GivenValue) => void) => {
           describe(scenario_title, () => {
-            it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
+            it(``, () => {
               const given_value = arrange();
               const when_result = act(given_value);

[Survived] CallExpression
source/lib/test-scenario-utility.ts:15:15
             it(`GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`, () => {
               const given_value = arrange();
               const when_result = act(given_value);
-              assert(when_result, given_value);
+              ;
             });
           });

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:26:12
 
 function scenario_for_values<InitialValue>(scenario_title: string, initial_values: readonly InitialValue[]) {
   return {
-    given: <GivenValue>(given_label: string, arrange: (initial_value: InitialValue) => GivenValue) => ({
-      when: <WhenResult>(
-        when_label: string,
-        act: (given_value: GivenValue) => WhenResult
-      ) => ({
-        then: (
-          then_label: string,
-          assert: (when_result: WhenResult, given_value: GivenValue) => void
-        ) => {
-          describe(scenario_title, () => {
-            const given_values = initial_values.map(arrange)
-            it.each(given_values)(
-              `GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`,
-              (given_value) => {
-                const when_result = act(given_value);
-                assert(when_result, given_value);
-              }
-            );
-          });
-        },
-      }),
-    }),
+    given: () => undefined,
   };
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:

# Unhandled error between tests
-------------------------------
91 |       })

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:27:13
 function scenario_for_values<InitialValue>(scenario_title: string, initial_values: readonly InitialValue[]) {
   return {
     given: <GivenValue>(given_label: string, arrange: (initial_value: InitialValue) => GivenValue) => ({
-      when: <WhenResult>(
-        when_label: string,
-        act: (given_value: GivenValue) => WhenResult
-      ) => ({
-        then: (
-          then_label: string,
-          assert: (when_result: WhenResult, given_value: GivenValue) => void
-        ) => {
-          describe(scenario_title, () => {
-            const given_values = initial_values.map(arrange)
-            it.each(given_values)(
-              `GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`,
-              (given_value) => {
-                const when_result = act(given_value);
-                assert(when_result, given_value);
-              }
-            );
-          });
-        },
-      }),
+      when: () => undefined,
     }),
   };
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:34:14
         then: (
           then_label: string,
           assert: (when_result: WhenResult, given_value: GivenValue) => void
-        ) => {
-          describe(scenario_title, () => {
-            const given_values = initial_values.map(arrange)
-            it.each(given_values)(
-              `GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`,
-              (given_value) => {
-                const when_result = act(given_value);
-                assert(when_result, given_value);
-              }
-            );
-          });
-        },
+        ) => {},
       }),
     }),

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:35:42
           then_label: string,
           assert: (when_result: WhenResult, given_value: GivenValue) => void
         ) => {
-          describe(scenario_title, () => {
-            const given_values = initial_values.map(arrange)
-            it.each(given_values)(
-              `GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`,
-              (given_value) => {
-                const when_result = act(given_value);
-                assert(when_result, given_value);
-              }
-            );
-          });
+          describe(scenario_title, () => {});
         },
       }),

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:39:32
             const given_values = initial_values.map(arrange)
             it.each(given_values)(
               `GIVEN ${given_label} WHEN ${when_label} THEN ${then_label}`,
-              (given_value) => {
-                const when_result = act(given_value);
-                assert(when_result, given_value);
-              }
+              (given_value) => {}
             );
           });

[Killed] ArrowFunction
source/lib/test-scenario-utility.ts:58:13
       givenLabel: string,
       setup: () => fc.Arbitrary<GivenSetupResult>
     ) => ({
-      when: <WhenActionResult>(
-        whenLabel: string,
-        action: (givenVal: GivenSetupResult) => WhenActionResult
-      ) => ({
-        then: (
-          thenLabel: string,
-          assertion: (whenResult: WhenActionResult, givenVal: GivenSetupResult) => void
-        ) => {
-          describe(scenarioTitle, () => {
-            it(`GIVEN ${givenLabel} WHEN ${whenLabel} THEN ${thenLabel}`, () => {
-              const arbitrary = setup();
-
-              fc.assert(
-                fc.property(arbitrary, (givenVal) => {
-                  const whenResult = action(givenVal);
-                  assertion(whenResult, givenVal);
-                })
-              );
-            });
-          });
-        },
-      }),
+      when: () => undefined,
     }),
   };
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 12x PARALLEL


source/nip.test.ts:

# Unhandled error between tests
-------------------------------

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:65:14
         then: (
           thenLabel: string,
           assertion: (whenResult: WhenActionResult, givenVal: GivenSetupResult) => void
-        ) => {
-          describe(scenarioTitle, () => {
-            it(`GIVEN ${givenLabel} WHEN ${whenLabel} THEN ${thenLabel}`, () => {
-              const arbitrary = setup();
-
-              fc.assert(
-                fc.property(arbitrary, (givenVal) => {
-                  const whenResult = action(givenVal);
-                  assertion(whenResult, givenVal);
-                })
-              );
-            });
-          });
-        },
+        ) => {},
       }),
     }),

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:66:41
           thenLabel: string,
           assertion: (whenResult: WhenActionResult, givenVal: GivenSetupResult) => void
         ) => {
-          describe(scenarioTitle, () => {
-            it(`GIVEN ${givenLabel} WHEN ${whenLabel} THEN ${thenLabel}`, () => {
-              const arbitrary = setup();
-
-              fc.assert(
-                fc.property(arbitrary, (givenVal) => {
-                  const whenResult = action(givenVal);
-                  assertion(whenResult, givenVal);
-                })
-              );
-            });
-          });
+          describe(scenarioTitle, () => {});
         },
       }),

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:67:81
           assertion: (whenResult: WhenActionResult, givenVal: GivenSetupResult) => void
         ) => {
           describe(scenarioTitle, () => {
-            it(`GIVEN ${givenLabel} WHEN ${whenLabel} THEN ${thenLabel}`, () => {
-              const arbitrary = setup();
-
-              fc.assert(
-                fc.property(arbitrary, (givenVal) => {
-                  const whenResult = action(givenVal);
-                  assertion(whenResult, givenVal);
-                })
-              );
-            });
+            it(`GIVEN ${givenLabel} WHEN ${whenLabel} THEN ${thenLabel}`, () => {});
           });
         },

[Survived] BlockStatement
source/lib/test-scenario-utility.ts:71:54
               const arbitrary = setup();
 
               fc.assert(
-                fc.property(arbitrary, (givenVal) => {
-                  const whenResult = action(givenVal);
-                  assertion(whenResult, givenVal);
-                })
+                fc.property(arbitrary, (givenVal) => {})
               );
             });

[Survived] CallExpression
source/lib/test-scenario-utility.ts:73:19
               fc.assert(
                 fc.property(arbitrary, (givenVal) => {
                   const whenResult = action(givenVal);
-                  assertion(whenResult, givenVal);
+                  ;
                 })
               );
