[Survived] BlockStatement
source/nip.ts:8:36
 class Nip {
   #value: string;
 
-  private constructor(nip: string) {
-    this.#value = nip;
-  }
+  private constructor(nip: string) {}
 
   static try_parse(nip_candidate: string): Result<Nip, NipError> {

[Survived] BlockStatement
source/nip.ts:12:66
     this.#value = nip;
   }
 
-  static try_parse(nip_candidate: string): Result<Nip, NipError> {
-    const result = validate_nip(nip_candidate)
-
-    if (!result.ok) return result;
-    else return ok(new Nip(result.value))
-  }
+  static try_parse(nip_candidate: string): Result<Nip, NipError> {}
 
   as_string(): string {

[Survived] BooleanLiteral
source/nip.ts:15:9
   static try_parse(nip_candidate: string): Result<Nip, NipError> {
     const result = validate_nip(nip_candidate)
 
-    if (!result.ok) return result;
+    if (result.ok) return result;
     else return ok(new Nip(result.value))
   }

[Survived] ConditionalExpression
source/nip.ts:15:9
   static try_parse(nip_candidate: string): Result<Nip, NipError> {
     const result = validate_nip(nip_candidate)
 
-    if (!result.ok) return result;
+    if (true) return result;
     else return ok(new Nip(result.value))
   }

[Survived] BlockStatement
source/nip.ts:19:23
     else return ok(new Nip(result.value))
   }
 
-  as_string(): string {
-    return this.#value;
-  }
+  as_string(): string {}
 
   equals(other: unknown): other is Nip {

[Survived] BlockStatement
source/nip.ts:23:40
     return this.#value;
   }
 
-  equals(other: unknown): other is Nip {
-    if (this === other) return true;
-    if (!(other instanceof Nip)) return false;
-
-    return this.#value === other.#value;
-  }
+  equals(other: unknown): other is Nip {}
 }
 

[Survived] ConditionalExpression
source/nip.ts:24:9
   }
 
   equals(other: unknown): other is Nip {
-    if (this === other) return true;
+    if (true) return true;
     if (!(other instanceof Nip)) return false;
 

[Survived] BooleanLiteral
source/nip.ts:24:32
   }
 
   equals(other: unknown): other is Nip {
-    if (this === other) return true;
+    if (this === other) return false;
     if (!(other instanceof Nip)) return false;
 

[Survived] ConditionalExpression
source/nip.ts:25:9
 
   equals(other: unknown): other is Nip {
     if (this === other) return true;
-    if (!(other instanceof Nip)) return false;
+    if (false) return false;
 
     return this.#value === other.#value;

[Survived] BooleanLiteral
source/nip.ts:25:41
 
   equals(other: unknown): other is Nip {
     if (this === other) return true;
-    if (!(other instanceof Nip)) return false;
+    if (!(other instanceof Nip)) return true;
 
     return this.#value === other.#value;

[Survived] ConditionalExpression
source/nip.ts:27:12
     if (this === other) return true;
     if (!(other instanceof Nip)) return false;
 
-    return this.#value === other.#value;
+    return true;
   }
 }

[Survived] EqualityOperator
source/nip.ts:27:12
     if (this === other) return true;
     if (!(other instanceof Nip)) return false;
 
-    return this.#value === other.#value;
+    return this.#value !== other.#value;
   }
 }

[Killed] BlockStatement
source/nip.ts:31:62
   }
 }
 
-function validate_nip(nip: string): Result<string, NipError> {
-
-  if (!has_valid_length(nip)) return err(invalid_length(nip));
-  if (!has_only_digits(nip)) return err(invalid_characters());
-
-  const control_digits = derive_nip_control_digits(nip);
-
-  if (control_digits.expected === 10) return err(invalid_control_digit());
-  if (control_digits.received !== control_digits.expected) return err(control_digit_mismatch(control_digits));
-
-  return ok(nip);
-
-}
+function validate_nip(nip: string): Result<string, NipError> {}
 
 const NIP_CONTROL_DIGIT_INDEX = 9
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 
12x PARALLEL



source/nip.test.ts
:

[Killed] ConditionalExpression
source/nip.ts:33:7
 
 function validate_nip(nip: string): Result<string, NipError> {
 
-  if (!has_valid_length(nip)) return err(invalid_length(nip));
+  if (true) return err(invalid_length(nip));
   if (!has_only_digits(nip)) return err(invalid_characters());
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [19.24ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.56ms]

[Killed] BooleanLiteral
source/nip.ts:33:7
 
 function validate_nip(nip: string): Result<string, NipError> {
 
-  if (!has_valid_length(nip)) return err(invalid_length(nip));
+  if (has_valid_length(nip)) return err(invalid_length(nip));
   if (!has_only_digits(nip)) return err(invalid_characters());
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
2464 | 	return error;
2465 | }
2466 | /** @internal */
2467 | function throwIfFailed(out) {

[Killed] ConditionalExpression
source/nip.ts:34:7
 function validate_nip(nip: string): Result<string, NipError> {
 
   if (!has_valid_length(nip)) return err(invalid_length(nip));
-  if (!has_only_digits(nip)) return err(invalid_characters());
+  if (false) return err(invalid_characters());
 
   const control_digits = derive_nip_control_digits(nip);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.26ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.73ms]

[Killed] ConditionalExpression
source/nip.ts:34:7
 function validate_nip(nip: string): Result<string, NipError> {
 
   if (!has_valid_length(nip)) return err(invalid_length(nip));
-  if (!has_only_digits(nip)) return err(invalid_characters());
+  if (true) return err(invalid_characters());
 
   const control_digits = derive_nip_control_digits(nip);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.95ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.57ms]

[Killed] ConditionalExpression
source/nip.ts:38:7
 
   const control_digits = derive_nip_control_digits(nip);
 
-  if (control_digits.expected === 10) return err(invalid_control_digit());
+  if (false) return err(invalid_control_digit());
   if (control_digits.received !== control_digits.expected) return err(control_digit_mismatch(control_digits));
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.06ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.34ms]

[Killed] ConditionalExpression
source/nip.ts:38:7
 
   const control_digits = derive_nip_control_digits(nip);
 
-  if (control_digits.expected === 10) return err(invalid_control_digit());
+  if (true) return err(invalid_control_digit());
   if (control_digits.received !== control_digits.expected) return err(control_digit_mismatch(control_digits));
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/pesel.test.ts
:

(pass) SCENARIO: rejects empty input > GIVEN empty input > WHEN empty input validated > THEN input is rejected [0.09ms]

[Killed] ConditionalExpression
source/nip.ts:39:7
   const control_digits = derive_nip_control_digits(nip);
 
   if (control_digits.expected === 10) return err(invalid_control_digit());
-  if (control_digits.received !== control_digits.expected) return err(control_digit_mismatch(control_digits));
+  if (false) return err(control_digit_mismatch(control_digits));
 
   return ok(nip);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] ConditionalExpression
source/nip.ts:39:7
   const control_digits = derive_nip_control_digits(nip);
 
   if (control_digits.expected === 10) return err(invalid_control_digit());
-  if (control_digits.received !== control_digits.expected) return err(control_digit_mismatch(control_digits));
+  if (true) return err(control_digit_mismatch(control_digits));
 
   return ok(nip);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.30ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.57ms]

(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Killed] BlockStatement
source/nip.ts:48:39
 const NIP_CONTROL_DIGIT_INDEX = 9
 const NIP_EXPECTED_LENGTH = 10
 
-function has_only_digits(nip: string) {
-  return /^\d+$/.test(nip);
-}
+function has_only_digits(nip: string) {}
 
 function has_valid_length(nip: string) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [11.12ms]

[Killed] Regex
source/nip.ts:49:10
 const NIP_EXPECTED_LENGTH = 10
 
 function has_only_digits(nip: string) {
-  return /^\d+$/.test(nip);
+  return /^\D+$/.test(nip);
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.38ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.78ms]

[Killed] Regex
source/nip.ts:49:10
 const NIP_EXPECTED_LENGTH = 10
 
 function has_only_digits(nip: string) {
-  return /^\d+$/.test(nip);
+  return /^\d$/.test(nip);
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.57ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.44ms]

[Killed] BlockStatement
source/nip.ts:52:40
   return /^\d+$/.test(nip);
 }
 
-function has_valid_length(nip: string) {
-  return nip.length === NIP_EXPECTED_LENGTH
-}
+function has_valid_length(nip: string) {}
 
 function derive_nip_control_digits(nip: string) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts
:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.38ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.47ms]

[Killed] EqualityOperator
source/nip.ts:53:10
 }
 
 function has_valid_length(nip: string) {
-  return nip.length === NIP_EXPECTED_LENGTH
+  return nip.length !== NIP_EXPECTED_LENGTH
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
2464 | 	return error;
2465 | }
2466 | /** @internal */
2467 | function throwIfFailed(out) {

[Killed] ConditionalExpression
source/nip.ts:53:10
 }
 
 function has_valid_length(nip: string) {
-  return nip.length === NIP_EXPECTED_LENGTH
+  return false
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.83ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.58ms]

2464 | 	return error;

[Killed] BlockStatement
source/nip.ts:56:49
   return nip.length === NIP_EXPECTED_LENGTH
 }
 
-function derive_nip_control_digits(nip: string) {
-  const NIP_WEIGHTS = [6, 5, 7, 2, 3, 4, 5, 6, 7]
-  const NIP_MODULO = 11
-
-  const digits = nip.split("").map(Number);
-  const digits_except_checksum = digits.slice(0, NIP_CONTROL_DIGIT_INDEX);
-
-  const sum = digits_except_checksum.reduce((acc, digit, index) => acc + digit * NIP_WEIGHTS[index]!, 0);
-
-  const expected_checksum = sum % NIP_MODULO;
-  const received_checksum = digits[NIP_CONTROL_DIGIT_INDEX]!;
-
-  return {
-    expected: expected_checksum,
-    received: received_checksum,
-  };
-
-}
+function derive_nip_control_digits(nip: string) {}
 
 function invalid_characters(): Readonly<NipError> {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.07ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.48ms]

[Killed] MethodExpression
source/nip.ts:61:34
   const NIP_MODULO = 11
 
   const digits = nip.split("").map(Number);
-  const digits_except_checksum = digits.slice(0, NIP_CONTROL_DIGIT_INDEX);
+  const digits_except_checksum = digits;
 
   const sum = digits_except_checksum.reduce((acc, digit, index) => acc + digit * NIP_WEIGHTS[index]!, 0);
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.60ms]

[Killed] ArithmeticOperator
source/nip.ts:63:68
   const digits = nip.split("").map(Number);
   const digits_except_checksum = digits.slice(0, NIP_CONTROL_DIGIT_INDEX);
 
-  const sum = digits_except_checksum.reduce((acc, digit, index) => acc + digit * NIP_WEIGHTS[index]!, 0);
+  const sum = digits_except_checksum.reduce((acc, digit, index) => acc - digit * NIP_WEIGHTS[index]!, 0);
 
   const expected_checksum = sum % NIP_MODULO;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [18.55ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.51ms]

[Killed] ArrowFunction
source/nip.ts:63:45
   const digits = nip.split("").map(Number);
   const digits_except_checksum = digits.slice(0, NIP_CONTROL_DIGIT_INDEX);
 
-  const sum = digits_except_checksum.reduce((acc, digit, index) => acc + digit * NIP_WEIGHTS[index]!, 0);
+  const sum = digits_except_checksum.reduce(() => undefined, 0);
 
   const expected_checksum = sum % NIP_MODULO;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.49ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.03ms]

[Killed] ArithmeticOperator
source/nip.ts:65:29
 
   const sum = digits_except_checksum.reduce((acc, digit, index) => acc + digit * NIP_WEIGHTS[index]!, 0);
 
-  const expected_checksum = sum % NIP_MODULO;
+  const expected_checksum = sum * NIP_MODULO;
   const received_checksum = digits[NIP_CONTROL_DIGIT_INDEX]!;
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 
12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.46ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [6.17ms]

[Killed] ObjectLiteral
source/nip.ts:68:10
   const expected_checksum = sum % NIP_MODULO;
   const received_checksum = digits[NIP_CONTROL_DIGIT_INDEX]!;
 
-  return {
-    expected: expected_checksum,
-    received: received_checksum,
-  };
+  return {};
 
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.45ms]

[Killed] BlockStatement
source/nip.ts:75:51
 
 }
 
-function invalid_characters(): Readonly<NipError> {
-  return {
-    name: "NipContainsNonDigits",
-    message: "NIP contains characters that are not digits"
-  }
-}
+function invalid_characters(): Readonly<NipError> {}
 
 function invalid_length(nip: string): Readonly<NipError> {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.79ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [8.35ms]

[Killed] StringLiteral
source/nip.ts:78:14
 function invalid_characters(): Readonly<NipError> {
   return {
     name: "NipContainsNonDigits",
-    message: "NIP contains characters that are not digits"
+    message: ""
   }
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.82ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [5.43ms]

[Killed] BlockStatement
source/nip.ts:82:58
   }
 }
 
-function invalid_length(nip: string): Readonly<NipError> {
-  return {
-    name: "NipInvalidLength",
-    message: "NIP has invalid length",
-    meta: {
-      expected_length: NIP_EXPECTED_LENGTH,
-      received_length: nip.length
-    }
-  }
-}
+function invalid_length(nip: string): Readonly<NipError> {}
 
 function invalid_control_digit(): Readonly<NipError> {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
2464 | 	return error;
2465 | }
2466 | /** @internal */
2467 | function throwIfFailed(out) {

[Killed] StringLiteral
source/nip.ts:84:11
 
 function invalid_length(nip: string): Readonly<NipError> {
   return {
-    name: "NipInvalidLength",
+    name: "",
     message: "NIP has invalid length",
     meta: {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
2464 | 	return error;
2465 | }
2466 | /** @internal */
2467 | function throwIfFailed(out) {

[Killed] BlockStatement
source/nip.ts:93:54
   }
 }
 
-function invalid_control_digit(): Readonly<NipError> {
-  return {
-    name: "NipCalculatedControlDigitCannotBeTen",
-    message: "Control digit calculated for NIP cannot equal 10"
-  }
-}
+function invalid_control_digit(): Readonly<NipError> {}
 
 function control_digit_mismatch(control_digit: { expected: number; received: number }): Readonly<NipError> {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] BlockStatement
source/nip.ts:100:108
   }
 }
 
-function control_digit_mismatch(control_digit: { expected: number; received: number }): Readonly<NipError> {
-  return {
-    name: "NipControlDigitMismatch",
-    message: "Received NIP control digit does not match calculated control digit",
-    meta:
-    {
-      expected_control_digit: control_digit.expected,
-      received_control_digit: control_digit.received,
-      control_digit_index: NIP_CONTROL_DIGIT_INDEX,
-    }
-  }
-}
+function control_digit_mismatch(control_digit: { expected: number; received: number }): Readonly<NipError> {}
 
 type NipError =
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.17ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.23ms]

[Killed] ObjectLiteral
source/nip.ts:105:5
     name: "NipControlDigitMismatch",
     message: "Received NIP control digit does not match calculated control digit",
     meta:
-    {
-      expected_control_digit: control_digit.expected,
-      received_control_digit: control_digit.received,
-      control_digit_index: NIP_CONTROL_DIGIT_INDEX,
-    }
+    {}
   }
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [20.76ms]
