[Killed] BlockStatement
source/pesel.ts:8:38
 class Pesel {
   #value: string
 
-  private constructor(value: string) {
-    this.#value = value
-  }
+  private constructor(value: string) {}
 
   static try_parse(candidate: unknown) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL




source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.38ms]

[Killed] BlockStatement
source/pesel.ts:12:40
     this.#value = value
   }
 
-  static try_parse(candidate: unknown) {
-    const result = validate_pesel(candidate as any)
-
-    if (!result.ok) return result
-
-    return ok(new Pesel(result.value))
-  }
+  static try_parse(candidate: unknown) {}
 
   as_string(): string {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] ConditionalExpression
source/pesel.ts:15:9
   static try_parse(candidate: unknown) {
     const result = validate_pesel(candidate as any)
 
-    if (!result.ok) return result
+    if (true) return result
 
     return ok(new Pesel(result.value))
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [27.52ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.44ms]

[Killed] BooleanLiteral
source/pesel.ts:15:9
   static try_parse(candidate: unknown) {
     const result = validate_pesel(candidate as any)
 
-    if (!result.ok) return result
+    if (result.ok) return result
 
     return ok(new Pesel(result.value))
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.30ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.40ms]

[Killed] BlockStatement
source/pesel.ts:20:23
     return ok(new Pesel(result.value))
   }
 
-  as_string(): string {
-    return this.#value
-  }
+  as_string(): string {}
 
   equals(other: unknown): other is Pesel {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] BlockStatement
source/pesel.ts:24:42
     return this.#value
   }
 
-  equals(other: unknown): other is Pesel {
-    if (!(other instanceof Pesel)) return false;
-    return this.#value === other.#value;
-  }
+  equals(other: unknown): other is Pesel {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.21ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.92ms]

[Killed] ConditionalExpression
source/pesel.ts:25:9
   }
 
   equals(other: unknown): other is Pesel {
-    if (!(other instanceof Pesel)) return false;
+    if (false) return false;
     return this.#value === other.#value;
   }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.46ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.41ms]

[Killed] ConditionalExpression
source/pesel.ts:25:9
   }
 
   equals(other: unknown): other is Pesel {
-    if (!(other instanceof Pesel)) return false;
+    if (true) return false;
     return this.#value === other.#value;
   }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [24.39ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [6.83ms]

[Killed] EqualityOperator
source/pesel.ts:26:12
 
   equals(other: unknown): other is Pesel {
     if (!(other instanceof Pesel)) return false;
-    return this.#value === other.#value;
+    return this.#value !== other.#value;
   }
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.56ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.28ms]

[Killed] ConditionalExpression
source/pesel.ts:26:12
 
   equals(other: unknown): other is Pesel {
     if (!(other instanceof Pesel)) return false;
-    return this.#value === other.#value;
+    return false;
   }
 }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.78ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.55ms]

(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Killed] StringLiteral
source/pesel.ts:30:73
   }
 }
 
-const ALLOWED_CHARACTERS: readonly string[] = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"];
+const ALLOWED_CHARACTERS: readonly string[] = ["0", "1", "2", "3", "4", "", "6", "7", "8", "9"];
 const ALLOWED_LENGTH = 11
 const PESEL_WEIGHTS = [1, 3, 7, 9, 1, 3, 7, 9, 1, 3, 1] as const;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.17ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.53ms]
(pass) parse_nip > perfect length input > GIVEN number of length = 10 WHE

[Killed] ArrayDeclaration
source/pesel.ts:30:47
   }
 }
 
-const ALLOWED_CHARACTERS: readonly string[] = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"];
+const ALLOWED_CHARACTERS: readonly string[] = [];
 const ALLOWED_LENGTH = 11
 const PESEL_WEIGHTS = [1, 3, 7, 9, 1, 3, 7, 9, 1, 3, 1] as const;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [15.15ms]

[Killed] ConditionalExpression
source/pesel.ts:35:7
 const PESEL_WEIGHTS = [1, 3, 7, 9, 1, 3, 7, 9, 1, 3, 1] as const;
 
 function validate_pesel(pesel_candidate: string) {
-  if (typeof pesel_candidate !== "string")
+  if (true)
     return err({
       name: "PeselIsNotString",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.35ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.16ms]

[Killed] ConditionalExpression
source/pesel.ts:35:7
 const PESEL_WEIGHTS = [1, 3, 7, 9, 1, 3, 7, 9, 1, 3, 1] as const;
 
 function validate_pesel(pesel_candidate: string) {
-  if (typeof pesel_candidate !== "string")
+  if (false)
     return err({
       name: "PeselIsNotString",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [28.95ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.21ms]

[Killed] StringLiteral
source/pesel.ts:37:13
 function validate_pesel(pesel_candidate: string) {
   if (typeof pesel_candidate !== "string")
     return err({
-      name: "PeselIsNotString",
+      name: "",
       message: "PESEL is not of type `string`"
     })
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.23ms]

[Killed] EqualityOperator
source/pesel.ts:41:7
       message: "PESEL is not of type `string`"
     })
 
-  if (pesel_candidate.length !== ALLOWED_LENGTH)
+  if (pesel_candidate.length === ALLOWED_LENGTH)
     return err({
       name: "PeselHasInvalidLength",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [26.53ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.68ms]

[Killed] ConditionalExpression
source/pesel.ts:41:7
       message: "PESEL is not of type `string`"
     })
 
-  if (pesel_candidate.length !== ALLOWED_LENGTH)
+  if (true)
     return err({
       name: "PeselHasInvalidLength",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/regon.test.ts:

[Killed] ObjectLiteral
source/pesel.ts:42:16
     })
 
   if (pesel_candidate.length !== ALLOWED_LENGTH)
-    return err({
-      name: "PeselHasInvalidLength",
-      message: "PESEL has invalid length"
-    })
+    return err({})
 
   for (const character of pesel_candidate) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/pesel.test.ts:
(pass) SCENARIO: rejects empty input > GIVEN empty input > WHEN empty input validated > THEN input is rejected [0.08ms]

322 |                               it(stryMutAct_9fa48("76") ? `` : (stryCov_9fa48("76"), `AND ${and.label}`), () => {

[Killed] BlockStatement
source/pesel.ts:47:44
       message: "PESEL has invalid length"
     })
 
-  for (const character of pesel_candidate) {
-    if (!ALLOWED_CHARACTERS.includes(character))
-      return err({
-        name: "PeselContainsNonDigitCharacters",
-        message: "PESEL contains non-numeric characters"
-      })
-
-  }
+  for (const character of pesel_candidate) {}
 
   const pesel_digits: number[] = pesel_candidate.split("").map(Number)
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.87ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.09ms]

[Killed] BooleanLiteral
source/pesel.ts:48:9
     })
 
   for (const character of pesel_candidate) {
-    if (!ALLOWED_CHARACTERS.includes(character))
+    if (ALLOWED_CHARACTERS.includes(character))
       return err({
         name: "PeselContainsNonDigitCharacters",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [12.66ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.49ms]

[Killed] ConditionalExpression
source/pesel.ts:48:9
     })
 
   for (const character of pesel_candidate) {
-    if (!ALLOWED_CHARACTERS.includes(character))
+    if (true)
       return err({
         name: "PeselContainsNonDigitCharacters",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.36ms]

[Killed] ObjectLiteral
source/pesel.ts:49:18
 
   for (const character of pesel_candidate) {
     if (!ALLOWED_CHARACTERS.includes(character))
-      return err({
-        name: "PeselContainsNonDigitCharacters",
-        message: "PESEL contains non-numeric characters"
-      })
+      return err({})
 
   }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.71ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.55ms]

[Killed] BlockStatement
source/pesel.ts:59:83
   const pesel_digits: number[] = pesel_candidate.split("").map(Number)
   const received_control_number = pesel_digits.pop()
 
-  const weighted_sum = pesel_digits.reduce((accumulator, current_digit, index) => {
-    return accumulator + (current_digit * PESEL_WEIGHTS[index]!)
-  }, 0)
+  const weighted_sum = pesel_digits.reduce((accumulator, current_digit, index) => {}, 0)
 
   const subtrahend = weighted_sum % 10;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/regon.test.ts:
(pass) SCENARIO: rejecting for invalid length > GIVEN input of length 0 > WHEN input is validated > THEN input is rejected for invalid length [0.12ms]

(pass) SCENARIO: rejecting for invalid length > GIVEN input of length 8 > WHEN input is validated > THEN input is rejected for invalid length [0.02ms]
(pass) SCENARIO: rejecting for i

[Killed] ArithmeticOperator
source/pesel.ts:60:12
   const received_control_number = pesel_digits.pop()
 
   const weighted_sum = pesel_digits.reduce((accumulator, current_digit, index) => {
-    return accumulator + (current_digit * PESEL_WEIGHTS[index]!)
+    return accumulator - current_digit * PESEL_WEIGHTS[index]!
   }, 0)
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL

[Killed] ArithmeticOperator
source/pesel.ts:60:27
   const received_control_number = pesel_digits.pop()
 
   const weighted_sum = pesel_digits.reduce((accumulator, current_digit, index) => {
-    return accumulator + (current_digit * PESEL_WEIGHTS[index]!)
+    return accumulator + (current_digit / PESEL_WEIGHTS[index]!)
   }, 0)
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] ArithmeticOperator
source/pesel.ts:63:22
     return accumulator + (current_digit * PESEL_WEIGHTS[index]!)
   }, 0)
 
-  const subtrahend = weighted_sum % 10;
+  const subtrahend = weighted_sum * 10;
   const calculated_control_number = subtrahend === 0 ? 0 : 10 - subtrahend;
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.66ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.46ms]

[Killed] EqualityOperator
source/pesel.ts:64:37
   }, 0)
 
   const subtrahend = weighted_sum % 10;
-  const calculated_control_number = subtrahend === 0 ? 0 : 10 - subtrahend;
+  const calculated_control_number = subtrahend !== 0 ? 0 : 10 - subtrahend;
 
   if (received_control_number !== calculated_control_number) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts
:

(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [16.17ms]

[Killed] ArithmeticOperator
source/pesel.ts:64:60
   }, 0)
 
   const subtrahend = weighted_sum % 10;
-  const calculated_control_number = subtrahend === 0 ? 0 : 10 - subtrahend;
+  const calculated_control_number = subtrahend === 0 ? 0 : 10 + subtrahend;
 
   if (received_control_number !== calculated_control_number) {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] ConditionalExpression
source/pesel.ts:66:7
   const subtrahend = weighted_sum % 10;
   const calculated_control_number = subtrahend === 0 ? 0 : 10 - subtrahend;
 
-  if (received_control_number !== calculated_control_number) {
+  if (true) {
     return err({
       name: "PeselControlDigitMismatch",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.63ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.45ms]

[Killed] ConditionalExpression
source/pesel.ts:66:7
   const subtrahend = weighted_sum % 10;
   const calculated_control_number = subtrahend === 0 ? 0 : 10 - subtrahend;
 
-  if (received_control_number !== calculated_control_number) {
+  if (false) {
     return err({
       name: "PeselControlDigitMismatch",
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/nip.test.ts:

[Killed] StringLiteral
source/pesel.ts:68:13
 
   if (received_control_number !== calculated_control_number) {
     return err({
-      name: "PeselControlDigitMismatch",
+      name: "",
       message: "Calculated control digit does not match one contained in the PESEL"
     })
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.03ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.47ms]
