[Survived] BlockStatement
source/regon.ts:8:38
 class Regon {
   #value: string;
 
-  private constructor(regon: string) {
-    this.#value = regon;
-  }
+  private constructor(regon: string) {}
 
   static try_parse(regon_candidate: string): Result<Regon, RegonError> {

[Survived] BlockStatement
source/regon.ts:12:72
     this.#value = regon;
   }
 
-  static try_parse(regon_candidate: string): Result<Regon, RegonError> {
-    const result = validate_regon(regon_candidate)
-
-    if (!result.ok) return result;
-    else return ok(new Regon(result.value))
-  }
+  static try_parse(regon_candidate: string): Result<Regon, RegonError> {}
 
   as_string(): string {

[Survived] ConditionalExpression
source/regon.ts:15:9
   static try_parse(regon_candidate: string): Result<Regon, RegonError> {
     const result = validate_regon(regon_candidate)
 
-    if (!result.ok) return result;
+    if (false) return result;
     else return ok(new Regon(result.value))
   }

[Survived] BlockStatement
source/regon.ts:23:42
     return this.#value;
   }
 
-  equals(other: unknown): other is Regon {
-    if (this === other) return true;
-    if (!(other instanceof Regon)) return false;
-
-    return this.#value === other.#value;
-  }
+  equals(other: unknown): other is Regon {}
 }
 

[Survived] ConditionalExpression
source/regon.ts:24:9
   }
 
   equals(other: unknown): other is Regon {
-    if (this === other) return true;
+    if (true) return true;
     if (!(other instanceof Regon)) return false;
 

[Survived] BooleanLiteral
source/regon.ts:24:32
   }
 
   equals(other: unknown): other is Regon {
-    if (this === other) return true;
+    if (this === other) return false;
     if (!(other instanceof Regon)) return false;
 

[Survived] ConditionalExpression
source/regon.ts:25:9
 
   equals(other: unknown): other is Regon {
     if (this === other) return true;
-    if (!(other instanceof Regon)) return false;
+    if (true) return false;
 
     return this.#value === other.#value;

[Survived] BooleanLiteral
source/regon.ts:25:9
 
   equals(other: unknown): other is Regon {
     if (this === other) return true;
-    if (!(other instanceof Regon)) return false;
+    if (other instanceof Regon) return false;
 
     return this.#value === other.#value;

[Killed] ConditionalExpression
source/regon.ts:35:7
 
 
 const validate_regon = (regon: string): { ok: true, value: string, error?: never } | Result<string, RegonError> => {
-  if (regon.length === 9) {
+  if (true) {
     if (!(/^\d+$/.test(regon))) return err(invalid_characters())
     if (regon === "0".repeat(9)) return err(contains_only_zeros())
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.81ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [4.77ms]

[Killed] ConditionalExpression
source/regon.ts:35:7
 
 
 const validate_regon = (regon: string): { ok: true, value: string, error?: never } | Result<string, RegonError> => {
-  if (regon.length === 9) {
+  if (false) {
     if (!(/^\d+$/.test(regon))) return err(invalid_characters())
     if (regon === "0".repeat(9)) return err(contains_only_zeros())
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.35ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.50ms]
(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Killed] BooleanLiteral
source/regon.ts:36:9
 
 const validate_regon = (regon: string): { ok: true, value: string, error?: never } | Result<string, RegonError> => {
   if (regon.length === 9) {
-    if (!(/^\d+$/.test(regon))) return err(invalid_characters())
+    if (/^\d+$/.test(regon)) return err(invalid_characters())
     if (regon === "0".repeat(9)) return err(contains_only_zeros())
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [23.67ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [10.79ms]

[Killed] ConditionalExpression
source/regon.ts:36:9
 
 const validate_regon = (regon: string): { ok: true, value: string, error?: never } | Result<string, RegonError> => {
   if (regon.length === 9) {
-    if (!(/^\d+$/.test(regon))) return err(invalid_characters())
+    if (true) return err(invalid_characters())
     if (regon === "0".repeat(9)) return err(contains_only_zeros())
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/regon.test.ts:
(pass) SCENARIO: rejecting for invalid length > GIVEN input of length 0 > WHEN input is validated > THEN input is rejected for invalid length [0.15ms]
(pass) SCENARIO: rejecting for invalid length > GIVEN input of length 8 > WHEN input is validated > THEN input is rejected for invalid length [0.02ms]
(pass) SCENARIO: rejecting for in

[Killed] EqualityOperator
source/regon.ts:37:9
 const validate_regon = (regon: string): { ok: true, value: string, error?: never } | Result<string, RegonError> => {
   if (regon.length === 9) {
     if (!(/^\d+$/.test(regon))) return err(invalid_characters())
-    if (regon === "0".repeat(9)) return err(contains_only_zeros())
+    if (regon !== "0".repeat(9)) return err(contains_only_zeros())
 
     const weights = [8, 9, 2, 3, 4, 5, 6, 7] as const;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.56ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.54ms]

[Killed] ConditionalExpression
source/regon.ts:37:9
 const validate_regon = (regon: string): { ok: true, value: string, error?: never } | Result<string, RegonError> => {
   if (regon.length === 9) {
     if (!(/^\d+$/.test(regon))) return err(invalid_characters())
-    if (regon === "0".repeat(9)) return err(contains_only_zeros())
+    if (false) return err(contains_only_zeros())
 
     const weights = [8, 9, 2, 3, 4, 5, 6, 7] as const;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.72ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.66ms]

[Killed] ArithmeticOperator
source/regon.ts:41:48
 
     const weights = [8, 9, 2, 3, 4, 5, 6, 7] as const;
 
-    let received_control_number = Number(regon[regon.length - 1]);
+    let received_control_number = Number(regon[regon.length + 1]);
 
     let weighted_sum = 0;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.29ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.96ms]

[Killed] BlockStatement
source/regon.ts:44:40
     let received_control_number = Number(regon[regon.length - 1]);
 
     let weighted_sum = 0;
-    weights.forEach((weight, index) => {
-      const regon_number = Number(regon[index]);
-      weighted_sum += weight * regon_number;
-    })
+    weights.forEach((weight, index) => {})
 
     const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.27ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.68ms]

[Killed] ArithmeticOperator
source/regon.ts:46:23
     let weighted_sum = 0;
     weights.forEach((weight, index) => {
       const regon_number = Number(regon[index]);
-      weighted_sum += weight * regon_number;
+      weighted_sum += weight / regon_number;
     })
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.67ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.79ms]

[Killed] AssignmentOperator
source/regon.ts:46:7
     let weighted_sum = 0;
     weights.forEach((weight, index) => {
       const regon_number = Number(regon[index]);
-      weighted_sum += weight * regon_number;
+      weighted_sum -= weight * regon_number;
     })
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL



source/pesel.test.ts:

[Killed] ArithmeticOperator
source/regon.ts:49:39
       weighted_sum += weight * regon_number;
     })
 
-    const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
+    const calculated_control_number = weighted_sum * 11 === 10 ? 0 : weighted_sum % 11
 
     if (received_control_number !== calculated_control_number)
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.55ms]
(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.72ms]

(pass) parse_nip > perfect length input > GIVEN number of length = 10 WH

[Killed] ConditionalExpression
source/regon.ts:49:39
       weighted_sum += weight * regon_number;
     })
 
-    const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
+    const calculated_control_number = true ? 0 : weighted_sum % 11
 
     if (received_control_number !== calculated_control_number)
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [24.19ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.69ms]

[Killed] ConditionalExpression
source/regon.ts:51:9
 
     const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
 
-    if (received_control_number !== calculated_control_number)
+    if (true)
       return err(invalid_control_digit({ received: received_control_number, expected: calculated_control_number, index: regon.length - 1 }))
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [16.95ms]


source/pesel.test.ts:

[Killed] ConditionalExpression
source/regon.ts:51:9
 
     const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
 
-    if (received_control_number !== calculated_control_number)
+    if (false)
       return err(invalid_control_digit({ received: received_control_number, expected: calculated_control_number, index: regon.length - 1 }))
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.01ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [9.98ms]

[Killed] ArithmeticOperator
source/regon.ts:52:121
     const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
 
     if (received_control_number !== calculated_control_number)
-      return err(invalid_control_digit({ received: received_control_number, expected: calculated_control_number, index: regon.length - 1 }))
+      return err(invalid_control_digit({ received: received_control_number, expected: calculated_control_number, index: regon.length + 1 }))
 
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [19.57ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [5.91ms]

[Killed] ConditionalExpression
source/regon.ts:58:7
     return ok(regon)
   }
 
-  if (regon.length === 14) {
+  if (false) {
     if (!(/^\d+$/.test(regon))) return err(invalid_characters())
     const weights = [2, 4, 8, 5, 0, 9, 7, 3, 6, 1, 2, 4, 8] as const;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [24.29ms]


source/pesel.test.ts:

[Killed] ConditionalExpression
source/regon.ts:58:7
     return ok(regon)
   }
 
-  if (regon.length === 14) {
+  if (true) {
     if (!(/^\d+$/.test(regon))) return err(invalid_characters())
     const weights = [2, 4, 8, 5, 0, 9, 7, 3, 6, 1, 2, 4, 8] as const;
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.98ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.89ms]

[Killed] BooleanLiteral
source/regon.ts:59:9
   }
 
   if (regon.length === 14) {
-    if (!(/^\d+$/.test(regon))) return err(invalid_characters())
+    if (/^\d+$/.test(regon)) return err(invalid_characters())
     const weights = [2, 4, 8, 5, 0, 9, 7, 3, 6, 1, 2, 4, 8] as const;
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.35ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.66ms]

[Killed] ConditionalExpression
source/regon.ts:59:9
   }
 
   if (regon.length === 14) {
-    if (!(/^\d+$/.test(regon))) return err(invalid_characters())
+    if (false) return err(invalid_characters())
     const weights = [2, 4, 8, 5, 0, 9, 7, 3, 6, 1, 2, 4, 8] as const;
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL



source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [17.81ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.00ms]

[Killed] EqualityOperator
source/regon.ts:70:39
       weighted_sum += weight * regon_number;
     })
 
-    const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
+    const calculated_control_number = weighted_sum % 11 !== 10 ? 0 : weighted_sum % 11
 
     const regon14_as_regon9 = regon.substring(0, 9)
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [19.05ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.57ms]

[Timeout] MethodExpression
source/regon.ts:72:31
 
     const calculated_control_number = weighted_sum % 11 === 10 ? 0 : weighted_sum % 11
 
-    const regon14_as_regon9 = regon.substring(0, 9)
+    const regon14_as_regon9 = regon
 
     const regon9_validation = validate_regon(regon14_as_regon9)

[Killed] ConditionalExpression
source/regon.ts:76:9
 
     const regon9_validation = validate_regon(regon14_as_regon9)
 
-    if (!regon9_validation.ok) {
+    if (false) {
       return { ok: false, error: regon9_validation.error }
     }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [13.62ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.61ms]

[Killed] ConditionalExpression
source/regon.ts:76:9
 
     const regon9_validation = validate_regon(regon14_as_regon9)
 
-    if (!regon9_validation.ok) {
+    if (true) {
       return { ok: false, error: regon9_validation.error }
     }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [37.46ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.43ms]

[Killed] BooleanLiteral
source/regon.ts:77:20
     const regon9_validation = validate_regon(regon14_as_regon9)
 
     if (!regon9_validation.ok) {
-      return { ok: false, error: regon9_validation.error }
+      return { ok: true, error: regon9_validation.error }
     }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a)
 
12
x PARALLEL

[Killed] ObjectLiteral
source/regon.ts:77:14
     const regon9_validation = validate_regon(regon14_as_regon9)
 
     if (!regon9_validation.ok) {
-      return { ok: false, error: regon9_validation.error }
+      return {}
     }
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [11.74ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [1.65ms]

[Killed] EqualityOperator
source/regon.ts:80:9
       return { ok: false, error: regon9_validation.error }
     }
 
-    if (received_control_number !== calculated_control_number)
+    if (received_control_number === calculated_control_number)
       return err(invalid_control_digit({ received: received_control_number, expected: calculated_control_number, index: regon.length - 1 }))
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [11.89ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.76ms]

[Killed] BlockStatement
source/regon.ts:90:40
   return err(invalid_length(regon))
 }
 
-function invalid_length(regon: string) {
-  return {
-    name: "RegonInvalidLength",
-    message: "REGON has invalid length",
-    meta: {
-      expected_length: [14, 9],
-      received_length: regon.length
-    }
-  }
-}
+function invalid_length(regon: string) {}
 
 function invalid_characters() {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [24.52ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [4.97ms]

[Killed] ArrayDeclaration
source/regon.ts:95:24
     name: "RegonInvalidLength",
     message: "REGON has invalid length",
     meta: {
-      expected_length: [14, 9],
+      expected_length: [],
       received_length: regon.length
     }
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [11.32ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.44ms]

[Killed] BlockStatement
source/regon.ts:101:31
   }
 }
 
-function invalid_characters() {
-  return {
-    name: "RegonContainsNonDigits",
-    message: "REGON contains characters that are not digits",
-  }
-}
+function invalid_characters() {}
 
 function contains_only_zeros() {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [18.65ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.65ms]

[Killed] BlockStatement
source/regon.ts:108:32
   }
 }
 
-function contains_only_zeros() {
-  return {
-    name: "RegonContainsOnlyZeros",
-    message: "Received REGON contains only digits equal to zero 0",
-  }
-}
+function contains_only_zeros() {}
 
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [19.99ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.26ms]

[Killed] BlockStatement
source/regon.ts:116:103
 }
 
 
-function invalid_control_digit(control_digit: { expected: number; received: number, index: number },) {
-  return {
-    name: "RegonControlDigitMismatch",
-    message: "Received REGON control digit does not match calculated control digit",
-    meta: {
-      expected_control_digit: control_digit.expected,
-      received_control_digit: control_digit.received,
-      control_digit_index: control_digit.index,
-    }
-  }
-}
+function invalid_control_digit(control_digit: { expected: number; received: number, index: number },) {}
 
 
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [18.94ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [3.20ms]

[Killed] StringLiteral
source/regon.ts:118:11
 
 function invalid_control_digit(control_digit: { expected: number; received: number, index: number },) {
   return {
-    name: "RegonControlDigitMismatch",
+    name: "",
     message: "Received REGON control digit does not match calculated control digit",
     meta: {
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [14.93ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [2.63ms]

[Killed] StringLiteral
source/regon.ts:119:14
 function invalid_control_digit(control_digit: { expected: number; received: number, index: number },) {
   return {
     name: "RegonControlDigitMismatch",
-    message: "Received REGON control digit does not match calculated control digit",
+    message: "",
     meta: {
       expected_control_digit: control_digit.expected,
killedBy: All tests
statusReason: bun test v1.3.14 (0d9b296a) 12x PARALLEL


source/nip.test.ts:
(pass) parse_nip > too long input > GIVEN string of length > 10 WHEN string is parsed as nip THEN string is rejected for being too long [16.28ms]

(pass) parse_nip > too short input > GIVEN nip number of length < 10 WHEN nip is parsed THEN nip is rejected [5.52ms]
